OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Src/py32f4xx_hal_canfd.c
  return status;
}
#endif /* USE_HAL_CANFD_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @defgroup CANFD_Exported_Functions_Group2 IO operation functions
 *  @brief    Configuration functions.
  * @{
  */

/**
  * @brief  Config CANFD filter
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  sFilter pointer to an CANFD_FilterTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_ConfigFilter(CANFD_HandleTypeDef *hcanfd, CANFD_FilterTypeDef *sFilter)
{
  HAL_CANFD_StateTypeDef state = hcanfd->State;

  /* Check function parameters */
  assert_param(IS_CANFD_ID_TYPE(sFilter->IdType));
  assert_param(IS_CANFD_FILTER_CHANNEL(sFilter->FilterChannel));
  assert_param(IS_CANFD_RANK(sFilter->Rank));
  assert_param(IS_CANFD_FILTER_ID(sFilter->FilterID));
  assert_param(IS_CANFD_FILTER_FORMAT(sFilter->FilterFormat));
  assert_param(IS_CANFD_MASK_ID(sFilter->MaskID));
  assert_param(IS_CANFD_MASK_FORMAT(sFilter->MaskFormat));
  
  if (state == HAL_CANFD_STATE_READY)
  {
    if (sFilter->Rank == CANFD_FILTER_RANK_NONE)
    {
      /* Disable Filter channel */
      CLEAR_BIT(hcanfd->Instance->ACFCR, (1U << (CANFD_ACFCR_AE_0_Pos + sFilter->FilterChannel)));
    }
    else
    {
      /* Specify acceptance filter address */
      MODIFY_REG(hcanfd->Instance->ACFCR, CANFD_ACFCR_ACFADR, sFilter->FilterChannel);

      /* Specify acceptance code Identifier and mask Identifier */
      if (sFilter->IdType == CANFD_STANDARD_ID)
      {
        hcanfd->Instance->ACFC.ID = sFilter->FilterID << 18;
        hcanfd->Instance->ACFM.ID = (~CANFD_LLC_STANDARD_ID_MSK) | (sFilter->MaskID << 18);
      }
      else
      {
        hcanfd->Instance->ACFC.ID = sFilter->FilterID;
        hcanfd->Instance->ACFM.ID = (~CANFD_LLC_EXTENDED_ID_MSK) | (sFilter->MaskID);
      }

      /* Specify acceptance code Format */
      hcanfd->Instance->ACFC.FORMAT = sFilter->FilterFormat;

      /* Specify acceptance mask Format */
      hcanfd->Instance->ACFM.FORMAT = (~CANFD_LLC_FORMAT_MSK) | (sFilter->MaskFormat);

      /* Specify acceptance mask Type */
      hcanfd->Instance->ACFM.TYPE = 0xFFFFFFFF;

      /* Specify acceptance mask Acceptance Field */
       hcanfd->Instance->ACFM.Reserved = 0xFFFFFFFF;
      /* Enable Filter channel*/
      SET_BIT(hcanfd->Instance->ACFCR, (1U << (CANFD_ACFCR_AE_0_Pos + sFilter->FilterChannel)));
    }

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_INITIALIZED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Add a message to the Tx FIFO
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  pTxHeader pointer to an CANFD_TxHeaderTypeDef structure.
  * @param  pData pointer to a buffer containing the payload of the Tx frame.
  * @param  TxFifoType Tx FIFO type.
  *         This parameter can be a value of @arg CANFD_fifo_type.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_AddMessageToTxFifo(CANFD_HandleTypeDef *hcanfd, CANFD_TxHeaderTypeDef *pTxHeader, uint8_t *pData, uint32_t TxFifoType)
{
  /* Check function parameters */
  assert_param(IS_CANFD_ID_TYPE(pTxHeader->IdType));
  if (pTxHeader->IdType == CANFD_STANDARD_ID)
  {
    assert_param(IS_CANFD_MAX_VALUE(pTxHeader->Identifier, 0x7FFU));
  }
  else /* pTxHeader->IdType == CANFD_EXTENDED_ID */
  {
    assert_param(IS_CANFD_MAX_VALUE(pTxHeader->Identifier, 0x1FFFFFFFU));
  }
  assert_param(IS_CANFD_TX_FRAME_TYPE(pTxHeader->TxFrameType));
  assert_param(IS_CANFD_FRAME_FORMAT(pTxHeader->FrameFormat));
  assert_param(IS_CANFD_Handle(pTxHeader->Handle));
  assert_param(IS_CANFD_DLC(pTxHeader->DataLength));
  assert_param(IS_CANFD_TX_FIFO_TYPE(TxFifoType));
  
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    if (TxFifoType == CANFD_TX_FIFO_PTB)
    {
      /* select PTB FIFO */
      CLEAR_BIT(hcanfd->Instance->MCR, CANFD_MCR_TBSEL);

      /* check that the PTB FIFO is not full */
      if (READ_BIT(hcanfd->Instance->MCR, CANFD_MCR_TPE) == 0)
      {
        /* Write data to the FIFO */
        CANFD_CopyMessageToFifo(hcanfd, pTxHeader, pData);
      }
      else
      {
        /* Update error code */
        hcanfd->ErrorCode |= HAL_CANFD_ERROR_FIFO_FULL;

        /* The PTB is transmitting data, Cannot write data to PTB FIFO */
        return HAL_ERROR;
      }
    }
    else
    {
      /* select STB FIFO */
      SET_BIT(hcanfd->Instance->MCR, CANFD_MCR_TBSEL);

      /* check that the STB FIFO is not full */
      if (__HAL_CANFD_GET_STB_FIFO_FREE_LEVEL(hcanfd) != CANFD_STB_FIFO_FULL)
      {
        /* Write data to the FIFO */
        CANFD_CopyMessageToFifo(hcanfd, pTxHeader, pData);
        
        /* this slot has been filled, CAN-CTRL connects the TBUF registers to the next slot.*/
        SET_BIT(CANFD->MCR, CANFD_MCR_TSNEXT);
      }
      else
      {
        /* Update error code */
        hcanfd->ErrorCode |= HAL_CANFD_ERROR_FIFO_FULL;

        /* The STB FIFO is full and cannot be written */
        return HAL_ERROR;
      }
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Activation the message is sent from Tx FIFO to the bus
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  activeTxMode Select the sending mode
  *         This parameter can be a value of @arg CANFD_transmit_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_ActivateTxRequest(CANFD_HandleTypeDef *hcanfd, uint32_t activeTxMode)
{
  /* Check function parameters */
  assert_param(IS_CANFD_TRANSMIT_MODE(activeTxMode));
  
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    if (activeTxMode == CANFD_TXFIFO_PTB_SEND)
    {
      /* PTB FIFO data start sending */
      SET_BIT(hcanfd->Instance->MCR,CANFD_MCR_TPE);
    }

    if (activeTxMode == CANFD_TXFIFO_STB_SEND_ONE)
    {
      /* Transmit STB FIFO one frame */
      SET_BIT(hcanfd->Instance->MCR,CANFD_MCR_TSONE);

      hcanfd->LastSTBTxType = CANFD_TXFIFO_STB_SEND_ONE;
    }
    else if (activeTxMode == CANFD_TXFIFO_STB_SEND_ALL)
    {
      /* Transmit STB FIFO all frame */
      SET_BIT(hcanfd->Instance->MCR,CANFD_MCR_TSALL);

      hcanfd->LastSTBTxType = CANFD_TXFIFO_STB_SEND_ALL;
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcanfd->ErrorCode |= HAL_CANFD_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Get Tx FIFO message
  * @param  hcanfd pointer to an CANFD_HandleTypeDef structure that contains
  *         the configuration information for the specified CANFD.
  * @param  pRxHeader pointer to an CANFD_RxHeaderTypeDef structure.
  * @param  pRxData pointer to a buffer containing the payload of the Rx frame.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CANFD_GetRxMessage(CANFD_HandleTypeDef *hcanfd, CANFD_RxHeaderTypeDef *pRxHeader, uint8_t *pRxData)
{
  uint8_t  *pData;
  uint32_t ByteCounter;
  uint32_t Format;
  
  if (hcanfd->State == HAL_CANFD_STATE_BUSY)
  {
    if (__HAL_CANFD_GET_RX_FIFO_FILL_LEVEL(hcanfd) == CANFD_RX_FIFO_EMPTY)
    {
      /* Update error code */
      hcanfd->ErrorCode |= HAL_CANFD_ERROR_FIFO_FULL;

      return HAL_ERROR;
    }

    Format = hcanfd->Instance->RBUF.FORMAT;
    pRxHeader->DataLength = Format & CANFD_LLC_FORMAT_DLC;
    pRxHeader->IdType = Format & CANFD_LLC_FORMAT_IDE;
    pRxHeader->RxFrameType = Format & CANFD_LLC_FORMAT_RMF;
    pRxHeader->FrameFormat = Format & (CANFD_LLC_FORMAT_BRS | CANFD_LLC_FORMAT_FDF);
    pRxHeader->ProtocolErrorType = (Format & CANFD_LLC_FORMAT_KOER)>>CANFD_LLC_FORMAT_KOER_Pos;
    pRxHeader->ErrorStateIndicator = Format & CANFD_LLC_FORMAT_ESI;
    pRxHeader->LoopBackIndicator = Format & CANFD_LLC_FORMAT_LBF;

    if (pRxHeader->IdType == CANFD_EXTENDED_ID)
    {
      pRxHeader->Identifier = hcanfd->Instance->RBUF.ID & CANFD_LLC_EXTENDED_ID_MSK;
    }
    else
    {
      pRxHeader->Identifier = (hcanfd->Instance->RBUF.ID & CANFD_LLC_STANDARD_ID_MSK) >> 18;
    }
    
